Tekla Open API Reference for Tekla Structures 2025
Filter.FilterExpression Property
 Gets the current FilterExpression instance.
 Namespace: Tekla.Structures.Filtering
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public FilterExpression FilterExpression { get; set; }
Public Property FilterExpression As FilterExpression
	Get
	Set
Property Value
Type: FilterExpression
Exceptions
Exception | Condition
NullReferenceException | Thrown when a null value is specified.
See Also
Reference
Filter Class
Tekla.Structures.Filtering Namespace